// pages = [
//     {
//         title: "contact",
//         children: [
//             {
//                 title: "1"
//             },
//             {
//                 title: "2",
//                 children: [
//                     {
//                         title>: "3"
//                     }
//                 ]
//             }
//         ]
//     }
// ]




// pages = ["contact"]
// children : ["1", "2"]

// // ///////////////////////////

// const pages = [
//     {
//         title: "تماس با ما",
//         children:[
//             {
//                 title:'درباره ما '
//             },
//             {
//                 title:'مسولیت اجتماعی'
//             },
//             {
//                 title:'خدمات ما'
//             },
//             {
//                 title:'نتایج زبان آموزان'
//             }

//         ]
//     },
//     {
//         title:'کلاس خصوصی زبان انگایسی'
//     },
//     {
//         title:'مقالات',
//             children:[
//             {
//                 title:'مهارت'
//             },
//             {
//                 title:'برچسب ها'
//             },
//             {
//                 title:'آموزش گرامر انگلیسی'
//             },
//             {
//                 title:'آموزش لغات انگلیسی '
//             },
//             {
//                 title:'الفبا و تلفظ انکلیسی'
//             },
//             {
//                 title:'مکالمات'
//             },
//             {
//                 title:'آموزش انگلیسی به کودکان'
//             },
//             {
//                 title:'آیلتس'
//             },
//             {
//                 title:'مهاجرت'
//             }
//         ]
//     },
//     {
//         title:'دوره های آموزشی'
//     },
//     {
//         title:'صفحه اصلی'
//     }
// ]